import os

# Токен бота считывается из переменной окружения на хостинге
TOKEN = os.getenv("BOT_TOKEN")

# ID твоего сервера (используется в bot.py для быстрой синхронизации команд)
GUILD_ID = 1529287678976327731

# ==========================================
#   ID КАНАЛОВ
# ==========================================
CHANNEL_IDS = {
    "APP_LOG": 1529305649773543566,       # заявки
    "APP_HISTORY": 1529306608650158190,   # история заявок (пока не используется ни одним cog)
    "AFK": 1529310050903134348,           # афк
    "VOICE_PANEL": 1529314337280364615,   # настройка голоса
    "VOICE_CREATE": 1529312842572890282,  # тригер (вход сюда создаёт приватный войс)
    "WELCOME": 1529290637042647191,       # привет
    "LOGS": 1529528536795316384,          # logs всего сервера
}

# ==========================================
#   ID РОЛЕЙ
# ==========================================
ROLE_IDS = {
    "NEW": 1529297900104974457,        # new — используется в applications.py и welcome.py
    "RECRUITER": 1529303122932011088,  # recruit — используется в applications.py

    # Остальные роли пока не задействованы в текущих cogs,
    # но сохранил на будущее, если понадобятся:
    "APATIA": 1529301296241446962,     # apatia
    "MAIN": 1529302133529251942,       # main
    "MAIN_PLUS": 1529302419236847708,  # main+
    "HIGH": 1529303735782736162,       # higt
    "DEP_OWN": 1529304333009817651,    # dep.own
    "OWNER": 1529304674237288489,      # owner
    "LEADER": 1529297297064726681,     # leader
}
